#해당 Control_Flow.py 에서는 제어문을 사용하는 걸 목적으로 잡고 있습니다.

#1-1.조건문과 참(True) / 거짓(False)==========================================================================

#일단 파이썬은 다른 언어와 좀 다른 부분이 있다면 이 조건문에서 뒤에 콜론(:)을 반스시 붙여주어야 합니다.
#그러면 이제 어떻게 사용 할까요?

if 10 > 20: #현재 조건을 보면 "10이 20보다 크냐?" 라는 구문 입니다. 즉 10이 20보다 작으니 거짓이 출력이 됩니다.
    print("참(True)")
else:
    print("거짓(False)")

#위 코드에서 ">" 무슨 뜻일까요? 바로 관계 연산자 입니다. 
#관계연산자 설명은 "https://github.com/Po0411/Project_Study/blob/main/%EC%96%B8%EC%96%B4/Python/Python.md"링크로 가서 확인해 주세요.